
## Plan Result (account-delete-monitor-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/93142)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * aws_lambda_function.eventtracker_lambda_2D56166D


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.eventtracker_lambda_2D56166D will be updated in-place
  ~ resource "aws_lambda_function" "eventtracker_lambda_2D56166D" {
        id                             = "AccountDeleteMonitor-Prod-EventTracker-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:AccountDeleteMonitor-Prod-EventTracker-Function:474" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:AccountDeleteMonitor-Prod-EventTracker-Function:474/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "AccountDeleteMonitor"
        }
      ~ version                        = "474" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"              = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"393e5042-c6c0-4cdd-b3b3-54c738279c4d","JobName":"account-delete-monitor_infrastructure_plan_prod","PRNumber":317,"Program":"tfcmt","SHA1":"57f397b949bc043b3469e8fe2e15d9ebec24b34c","Target":"account-delete-monitor-cdk","Vars":{}} -->